In [1]:
import pandas as pd
from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals())
df = pd.read_excel('data.xlsx', index_col=0)

# 1 Опишите имеющиеся колонки в данных - сделайте аналог describe в pandas для колонок.

In [2]:
q = """SELECT    
        COUNT(Cust_Id),
        AVG(Cust_Id),
        MIN(Cust_Id),
        MAX(Cust_Id)     
        FROM df"""
id_ = pysqldf(q)
q = """SELECT    
        COUNT(Purchase),
        AVG(Purchase),
        MIN(Purchase),
        MAX(Purchase)          
        FROM df"""
purchase = pysqldf(q)
q = """SELECT    
        COUNT(Cheq_Bal),
        AVG(Cheq_Bal),
        MIN(Cheq_Bal),
        MAX(Cheq_Bal)      
        FROM df"""
cheq_Bal = pysqldf(q)
q = """SELECT    
        COUNT(Sav_Bal),
        AVG(Sav_Bal),
        MIN(Sav_Bal),
        MAX(Sav_Bal)     
        FROM df"""
sav_Bal = pysqldf(q)
q = """SELECT    
        COUNT(Debt_Bal),
        AVG(Debt_Bal),
        MIN(Debt_Bal),
        MAX(Debt_Bal)     
        FROM df"""
debt_Bal = pysqldf(q)
q = """SELECT    
        COUNT(Debt_Bal),
        AVG(Debt_Bal),
        MIN(Debt_Bal),
        MAX(Debt_Bal)      
        FROM df"""
joint_Acct = pysqldf(q)
q = """SELECT    
        COUNT(Age),
        AVG(Age),
        MIN(Age),
        MAX(Age)       
        FROM df"""
age = pysqldf(q)
print(id_, purchase, cheq_Bal, sav_Bal, debt_Bal, joint_Acct, age, sep="\n")

   COUNT(Cust_Id)  AVG(Cust_Id)  MIN(Cust_Id)  MAX(Cust_Id)
0             200         100.5             1           200
   COUNT(Purchase)  AVG(Purchase)  MIN(Purchase)  MAX(Purchase)
0              200          0.195              0              1
   COUNT(Cheq_Bal)  AVG(Cheq_Bal)  MIN(Cheq_Bal)  MAX(Cheq_Bal)
0              200      2145.0935         644.31        4437.44
   COUNT(Sav_Bal)  AVG(Sav_Bal)  MIN(Sav_Bal)  MAX(Sav_Bal)
0             200   22084.42895       6558.91      39132.63
   COUNT(Debt_Bal)  AVG(Debt_Bal)  MIN(Debt_Bal)  MAX(Debt_Bal)
0              200      8638.3696            0.0        20559.7
   COUNT(Debt_Bal)  AVG(Debt_Bal)  MIN(Debt_Bal)  MAX(Debt_Bal)
0              200      8638.3696            0.0        20559.7
   COUNT(Age)  AVG(Age)  MIN(Age)  MAX(Age)
0         200    38.535        18        60

# 2. Посчитайте совокупный объем средств у клиентов в банке - сумма по всем балансам.

In [3]:
q = """SELECT 
        Cust_ID,
        Cheq_Bal+Sav_Bal+Debt_Bal AS TOTAL_bal
        FROM df"""
pysqldf(q).head()

   Cust_ID  TOTAL_bal
0        1   41221.59
1        2   41413.90
2        3   33055.88
3        4   42272.94
4        5   27464.44

# 3 Выведите только тех клиентов, которые приобрели ипотеку (колонка mortgage).

In [4]:
q = """SELECT * 
        FROM df
        WHERE Purchase = 1        
        """
pysqldf(q).head()

,Cust_ID,Purchase,Cheq_Bal,Sav_Bal,Debt_Bal,Joint_Acct,Age,Date
0,4,1,2880.28,32317.63,7075.03,0,28,2017-04-30 00:00:00.000000
1,6,1,1936.83,34793.91,5107.54,1,18,2017-05-30 00:00:00.000000
2,7,1,3120.64,26794.63,0.00,0,18,2017-08-13 00:00:00.000000
3,11,1,3102.62,30968.27,4061.99,1,30,2017-05-16 00:00:00.000000
4,13,1,3130.37,25835.62,0.00,1,18,2017-07-07 00:00:00.000000

# 4 Какой совокупный объем средств в среднем у клиентов, которые приобрели ипотеку и у клиентов, которые её не приобретали?

In [5]:
q = """SELECT 
            SUM(CASE WHEN Purchase=1 THEN Cheq_Bal+Sav_Bal+Debt_Bal END) / COUNT(CASE WHEN Purchase=1 THEN 1 END) as Purchase,
            SUM(CASE WHEN Purchase=0 THEN Cheq_Bal+Sav_Bal+Debt_Bal END) / COUNT(CASE WHEN Purchase=0 THEN 1 END) as Non_Purchase
            FROM df
        """

pysqldf(q).head()

       Purchase  Non_Purchase
0  36054.895385  32095.885031

# 5 Есть ли разница в среднем по каждому из типов баланса у клиентов, которые приобрели ипотеку и у клиентов, которые её не приобретали?

In [6]:
q = """SELECT 
            SUM(CASE WHEN Purchase=1 THEN Cheq_Bal END) / COUNT(CASE WHEN Purchase=1 THEN 1 END) -
            SUM(CASE WHEN Purchase=0 THEN Cheq_Bal END) / COUNT(CASE WHEN Purchase=0 THEN 1 END) as Cheq_Bal_diff,
            
            SUM(CASE WHEN Purchase=1 THEN Sav_Bal END) / COUNT(CASE WHEN Purchase=1 THEN 1 END) -
            SUM(CASE WHEN Purchase=0 THEN Sav_Bal END) / COUNT(CASE WHEN Purchase=0 THEN 1 END) as Sav_Bal_diff,
            
            SUM(CASE WHEN Purchase=1 THEN Debt_Bal END) / COUNT(CASE WHEN Purchase=1 THEN 1 END) -
            SUM(CASE WHEN Purchase=0 THEN Debt_Bal END) / COUNT(CASE WHEN Purchase=0 THEN 1 END) as Debt_Bal_diff
            
            FROM df
        """

pysqldf(q).head()

   Cheq_Bal_diff  Sav_Bal_diff  Debt_Bal_diff
0     761.344275   9370.354545   -6172.688466

# 6 Выберите самого возрастного получателя ипотеки.

In [7]:
q = """SELECT Cust_Id, 
        MAX(Age)
        FROM df    
        """
pysqldf(q).head()

   Cust_ID  MAX(Age)
0       34        60

# 7 Выберите клиента, который раньше всех получил ипотеку.

In [8]:
q = """SELECT Cust_Id, 
        MIN(Date)
        FROM df    
        """
pysqldf(q).head()

   Cust_ID                   MIN(Date)
0      185  2017-04-01 00:00:00.000000

# 8 Создайте любую базу данных в sqlite3, состоящую из 5 колонок, одна из колонок обязательно должна быть типа REAL. (Названия колонок любые, какие захотите)

In [9]:
import sqlite3
connected_ = sqlite3.connect("proct3.db")
db = connected_.cursor()
db.execute("CREATE TABLE taab(ID, name, birth, wheit, mama_wheit)")

# 9 Добавьте 3 полностью заполненные строки в вашу БД.

In [10]:
db.execute("""
    INSERT INTO taab VALUES
        (1, 'Vasya Pupkin', 2001, 83, 98345085349),
        (2, 'Elena Golovach', 1965, 56, 52),
        (3, 'Mathieu Bal', 1998, 103 , 60)
""")

some = db.execute("""SELECT * 
        FROM taab
        """)
some.fetchall()

[(1, 'Vasya Pupkin', 2001, 83, 98345085349),
 (2, 'Elena Golovach', 1965, 56, 52),
 (3, 'Mathieu Bal', 1998, 103, 60)]

# 10 Удалите строку из колонки типа REAL (из пункта 8), в которой значение признака среднее (то есть не минимальное и не максимальное). Напрямую указывать значение из этой строки нельзя.

In [11]:
connected_.execute("""
            DELETE FROM taab
            WHERE 
            mama_wheit <> (select MAX(mama_wheit) from taab)
            AND 
            mama_wheit <> (select MIN(mama_wheit) from taab)
            """)
some = db.execute("""SELECT * 
        FROM taab
        """)
some.fetchall()

[(1, 'Vasya Pupkin', 2001, 83, 98345085349),
 (2, 'Elena Golovach', 1965, 56, 52)]

In [12]:
db.execute("""DROP TABLE taab;""")
connected_.close()

спасибо за проверку!